import 'package:flutter/material.dart';
import 'package:rowad_hrag/core/extensions/extensions.dart';
import 'package:rowad_hrag/core/theme/app_colors.dart';
import 'package:rowad_hrag/features/layout/presentation/widget/home_buttons_selector_footer_widget.dart';

class TermsAndConditions extends StatelessWidget {
  const TermsAndConditions({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          "البنود والظروف",
          style: Theme.of(context).textTheme.titleLarge!.copyWith(
            fontWeight: FontWeight.bold,
            color: AppColors.primaryColor,
          ),
        ),
        leading: IconButton(
          onPressed: () => Navigator.pop(context),
          icon: const Icon(
            Icons.arrow_back_ios,
            color: AppColors.primaryColor,
            size: 20,
          ),
        ),
        elevation: 0,
      ),
      body: SingleChildScrollView(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            _buildSection(
              context,
              title: "مقدمة",
              content: """
إن اتفاقية الاستخدام هذه وخصوصية الاستخدام، والشروط والبنود، وجميع السياسات التي تم نشرها على منصة رواد حراج وضعت لحماية وحفظ حقوق كل من مؤسسة موقع رواد حراج لتقنية المعلومات والمستخدم الذي يصل إلى الموقع بتسجيل أو من دون تسجيل أو المستهلك المستفيد من المحتوى بتسجيل أو من دون تسجيل.
تخضع البنود والشروط والأحكام والمنازعات القانونية للقوانين والتشريعات والأنظمة المعمول بها في المملكة العربية السعودية.
لكونك مستخدمًا أو مستهلكًا على منصة رواد حراج فإنك توافق على الالتزام بكل ما يرد بهذه الاتفاقية بمجرد استخدامك للمنصة أو في حال الوصول إليها أو في حالة التسجيل في الخدمة. كما يحق لمنصة رواد حراج التعديل على هذه الاتفاقية في أي وقت وتعتبر ملزمة لجميع الأطراف بعد الإعلان عن التحديث في الموقع أو في أي وسيلة أخرى.
              """,
            ),
            _buildSection(
              context,
              title: "المادة الأولى: تعريف",
              content: """
1. منصة رواد حراج: هي منصة إلكترونية تتيح للمستخدمين فتح حساب لنشر المحتوى الخاص به وفق الأنظمة والتشريعات، مقرها الرئيسي مكة المكرمة ويشار إليها بهذه الاتفاقية باسم مؤسسة موقع رواد حراج لتقنية المعلومات (الجهة المالكة لمنصة رواد حراج) أو نحن أو لنا أو الموقع أو المنصة أو الطرف الأول.

2. المستخدم: هو منشئ الحساب على منصة رواد حراج لغرض التواصل أو التصفح أو نشر المحتوى أو لإنشاء محل إلكتروني كموفر خدمة لممارسة التجارة الإلكترونية على منصة حراج، ويشار إليه في هذه الاتفاقية بالعضو أو الممارس أو موفر الخدمة أو الطرف الثاني.

3. المحل الإلكتروني: هو الحساب الإلكتروني الذي يتيح للمستخدم عرض منتج، أو بيعه، أو تقديم خدمة، أو الإعلان عنها أو تبادل البيانات الخاصة بها.
              """,
            ),
            _buildSection(
              context,
              title: "المادة الثانية: شروط الاستخدام",
              content: """
بصفتك طرفًا ثانيًا في هذه الاتفاقية ولكونك مستفيدًا من خدمات منصة رواد حراج فعليك الالتزام بالتالي:
1. عدم الإعلان أو تحميل محتوى أو عناصر غير ملائمة للتصنيفات المتاحة في المنصة والمسموح ببيعها ومراجعة شروط الإعلان والسلع الممنوعة قبل الإعلان.
2. عدم الاختراق أو التحايل على قوانين وسياسة وأنظمة المنصة أو أي حقوق تتعلق بطرف ثالث.
3. عدم نسخ الإعلان من منصة رواد حراج وإعادة نشرها في مواقع أخرى.
4. عدم استخدام أي وسيلة غير شرعية للوصول للإعلانات أو بيانات المستخدمين الآخرين أو انتهاك سياسة وحقوق مؤسسة موقع رواد حراج لتقنية المعلومات أو الوصول لمحتوى المنصة أو تجميع وتحصيل معلومات وبيانات تخص منصة رواد حراج أو عملاءها والاستفادة منها بأي شكل من الأشكال أو إعادة نشرها.
5. عدم استخدام خدماتنا إذا كنت غير مؤهل قانونيًا لإتمام هذه الاتفاقية.
6. عدم التلاعب بأسعار السلع سواء في البيع أو الشراء وإلحاق الضرر بالمستهلكين الآخرين.
7. عدم تضمين الإعلان عرضًا أو بيانًا أو ادعاءً كاذبًا أو مصوغًا بعبارات من شأنها أن تؤدي بصورة مباشرة أو غير مباشرة إلى خداع المستهلك أو تضليله، أو القذف، أو التشهير.
8. عدم التعرض للسياسات، أو السيادات الدولية، أو الشخصيات المعتبرة، أو أي مناقشات غير مشروعة في مؤسسة موقع رواد حراج لتقنية المعلومات.
9. عدم نقل حسابك أو نشاطك إلى مواقع أخرى بالوقت الذي يحمل شعار أو خدمات المؤسسة.
10. عدم انتهاك حقوق الملكية الفكرية لمؤسسة موقع رواد حراج لتقنية المعلومات، بما في ذلك حقوق الطبع والنشر والعلامات التجارية، وبراءات الاختراع، والدعاية وقواعد البيانات أو غيرها من حقوق الملكية الفكرية التي تنتمي للمؤسسة أو المرخصة لمؤسسة موقع رواد حراج لتقنية المعلومات.
11. عدم تضمين الإعلان شعارًا أو علامة تجارية لا تملك حق استعمالها، أو علامة مقلدة وكل ما فيه انتهاك حقوق الملكية الفكرية للآخرين أو براءة اختراع.
12. عدم الإعلان عن منتجات التبغ والدخان (هذه السلع تعرضك للمخالفة من قبل الجهات المختصة).
13. عدم انتهاك أنظمة حقوق الإنسان والمتاجرة بالأشخاص بأي شكل من الأشكال والالتزام بضوابط الإعلان عن تقديم الخدمات العمالية.
14. الالتزام بضوابط الإعلان العقاري التي حددتها الهيئة العامة للعقار.
15. يجب الحصول على ترخيص من وزارة السياحة لتقديم أي عروض أو منتجات سياحية.
16. يجب الالتزام بالضوابط والتراخيص الصادرة من المركز الوطني لحماية الحياة الفطرية.
17. عدم جمع أو استعمال بيانات مستخدمي الموقع الشخصية أو اتصالاتهم الإلكترونية لأغراض غير مصرح بها أو مسموح بها، أو الإفصاح عنها لجهة أخرى، بمقابل أو بدون مقابل، إلا بموافقة من تتعلق به البيانات الشخصية أو إذا اقتضت الأنظمة ذلك.
18. عدم الإقدام على أي ما من شأنه إلحاق الضرر بسمعة مؤسسة موقع رواد حراج لتقنية المعلومات بأي شكل كان سواء كان ذلك في المنصة نفسها أو على منصات التواصل الاجتماعي الأخرى وتحتفظ المؤسسة بحقها في الرجوع عليك بكافة الأضرار المترتبة جراء ذلك.
19. عدم انتحال صفة مؤسسة موقع رواد حراج لتقنية المعلومات أو ممثل لها أو موظف فيها أو أي صفة توحي بأنك تابع للمؤسسة ما لم يكن لديك إذن رسمي من المؤسسة.
20. يُمنع استخدام هذه الخدمة من قِبل أي مستخدم غير بشري ويستثنى من ذلك المستخدمين غير البشريين التابعين للشركات التالية فقط:
    • Google
    • Facebook
    • X
              """,
            ),
            _buildSection(
              context,
              title: "المادة الثالثة: المسؤولية",
              content: """
1. تقدم مؤسسة موقع رواد حراج لتقنية المعلومات خدمة تمكين المستخدم من عرض سلعته ونشر المحتوى وفق سياسة الاستخدام المتفق عليها ولا تقدم أي ضمانات ولا تتحمل أي مسؤولية في حالة عدم التزام المستخدم أو المستهلك بها.
2. تخلي منصة رواد حراج مسؤوليتها من أي مخاطرة أو أضرار أو تبعات أو خسائر تقع على البائع أو المشتري أو أي طرف آخر، وعلى من لحق به الضرر زيارة رابط "اتصل بنا" وشرح الضرر الواقع عليه وستقوم المؤسسة باتخاذ الإجراء حسب نوع الواقعة دون أدنى مسؤولية.
3. باستخدامك لمنصة رواد حراج يعني أنك تقر بتحمل كامل المسؤولية في التأكد من اتباع جميع القوانين، واللوائح، والأنظمة ذات الصلة عند استخدام المنصة. كما تتحمل مسؤولية إدارة جميع عمليات الشراء وعمليات التسليم في حال كان الحساب محل إلكتروني، وحل المشكلات والنزاعات الناشئة عن محتوى الإعلان مسؤولية كاملة، كما تلتزم بضوابط وشروط المحتوى الموضحة من قبل منصة رواد حراج وتتحمل وحدك تبعات وأضرار المحتوى وتخلي مسؤولية منصة رواد حراج من أي مطالبات ناتجة أو تابعة لتعاملاتك أو مترتبة عليها.
4. باستخدامك لمنصة رواد حراج يعني أنك تخول للمنصة حفظ البيانات والمعلومات الشخصية وغير الشخصية التي قمت بإدخالها بخوادم المؤسسة ولنا حق الاطلاع عليها ومراجعتها.
5. باستخدامك لمنصة رواد حراج فإنك تقر بأحقية المنصة في مراقبة الرسائل الخاصة عند الحاجة لضمان خلوها من مخالفات اتفاقية الاستخدام و لنا الحق في حذف الإعلان والتصرف بالصور المرفقة عند الحاجة لذلك.
6. تعتبر تعاميم وقرارات وتوجيهات إدارة ومشرفي الموقع ملزمة للطرف الثاني بعد إيصالها له عبر الرسائل الخاصة بالموقع أو الجوال أو البريد الإلكتروني أو عبر نظام الإشعارات، وعليه الالتزام بها والعمل بموجبها.
7. باستخدامك للمنصة فإنك تقر بأحقية منصة رواد حراج في حال مخالفتك للأنظمة والقوانين المتبعة في المملكة أو لسياسات وقوانين منصة رواد حراج فإن لمؤسسة موقع رواد حراج الحق بالرجوع عليك بكافة الأضرار والخسائر وتحميلك أتعاب المحاماة في جميع المسائل والقضايا المتعلقة بمخالفتك وتلتزم بالتعويض عنها.
              """,
            ),
            // You can continue adding other sections similarly...
            // For brevity, we'll include one more example
            _buildSection(
              context,
              title: "المادة السابعة: السلع الممنوعة",
              content: """
سيتم حظر المعلن الذي يقوم بالإعلان عن السلع الموضحة (السلع الممنوعة) في المنصة. حيث يمنع الإعلان عنها أو شراؤها ونقوم بحظر من يتجاوب معه عبر الرسائل الخاصة أو عبر الردود. كما نرجو ملاحظة أن ليس هناك تنبيه قبل الحظر وأن الحظر نهائي لا نقاش فيه.
السلع الممنوعة هي:
1. جميع السلع الممنوعة حسب قوانين المملكة العربية السعودية.
2. التقسيط والمنتجات البنكية. هذه السلع ممنوعة حتى لو كانت تعتبر شرعية.
3. الأدوية والمنتجات الطبية والصحية. هذه السلع ممنوعة حتى لو كان مسموح بها في قوانين وزارة الصحة وحتى لو كانت سلعًا موصى بها من الوزارة.
4. التسويق الشبكي. يمنع نهائياً أي نوع من التسويق الشبكي مهما كان نوعه أو صفته أو طريقته.
5. الأسلحة بما فيها الصواعق والمسدسات والرشاشات وأسلحة الحماية الشخصية ومستلزماتها حتى لو كانت مرخصة.
6. المنتجات الجنسية بكافة أشكالها وأنواعها.
7. الأسهم وإدارة المحافظ والعملات وتسويقها وجميع ما يتعلق بذلك.
8. أجهزة الليزر وأجهزة التجسس والتنصت.
9. المواقع والمنتديات والخدمات الإلكترونية والإيميلات وبيع العضويات والبرامج.
10. بيع أي سلعة مجانية. مثال على ذلك الإيميلات وحسابات تويتر وإنستغرام وغيرها.
11. السلع التي فيها اعتداء على حقوق الملكية الفكرية مثل البرامج المنسوخة والأفلام المنسوخة.
12. منتجات التبغ.
13. الإعلان عن منتجات أو خدمات تتطلب ترخيصًا من دون الحصول على الترخيص من الجهة المنظمة.
14. الأجهزة الممنوعة مثل: أجهزة التشويش أو التشفير أو تقوية إشارة الجوال.
15. الأجهزة ذات المخاطر الأمنية.
16. الإعلان عن شرائح اتصال أو خدمات اتصالات من دون الحصول على التراخيص اللازمة ومن دون رفعها لنظام التراخيص بالموقع.
17. جمع وبيع البيانات ومخالفة نظام حماية البيانات الشخصية.
              """,
            ),
            HomeButtonsSelectorFooterWidget(),
          ],
        ),
      ),
    );
  }

  Widget _buildSection(BuildContext context, {required String title, required String content}) {
    return Column(
      crossAxisAlignment: CrossAxisAlignment.end,
      children: [
        Text(
          title,
          style: Theme.of(context).textTheme.titleMedium!.copyWith(
            fontWeight: FontWeight.bold,

            color: Colors.black,
          ),
          textAlign: TextAlign.right,
        ),
        const SizedBox(height: 8),
        Text(
          content.trim(),
          style: Theme.of(context).textTheme.bodyLarge!.copyWith(
            color: Colors.black,
            height: 1.6,
            fontSize: 14,
          ),
          textAlign: TextAlign.right,
          textDirection: TextDirection.rtl,
        ),
        const SizedBox(height: 16),

      ],
    ).hPadding(0.03.width);
  }
}